from balethon.objects import ReplyKeyboard

start = ReplyKeyboard(
    ["📊 ایجاد نظرسنجی"],
    ["🗂 نظرسنجی های من"],
    ["📕 راهنمایی", "👤 پشتیبانی"],
    ["💰 تعرفه تبلیغات"]
)

admin_start = ReplyKeyboard(
    ["📊 ایجاد نظرسنجی"],
    ["🗂 نظرسنجی های من"],
    ["📕 راهنمایی", "👤 پشتیبانی"],
    ["💰 تعرفه تبلیغات"],
    ["پنل ادمین ها"]
)

poll_types = ReplyKeyboard(
    ["نظرسنجی عادی"],
    ["نظرسنجی چند جوابی"],
    ["نظرسنجی آزمون"]
)

poll_modes = ReplyKeyboard(
    ["خصوصی", "عمومی"]
)

complete_poll = ReplyKeyboard(
    ["تکمیل نظرسنجی ☑️"]
)

admins_panel = ReplyKeyboard(
    ["آمار"],
    ["ارسال به پیوی ها"],
    ["ارسال به گروه ها"],
    ["ارسال همگانی"],
    ["فوروارد به پیوی ها"],
    ["فوروارد به گروه ها"],
    ["فوروارد همگانی"],
    ["برگشت 🔙"]
)
