poll = """
💠 *{question}*

{options}

👥 تعداد آراء: {voters_count} نفر
{type_name}
_کد نظرسنجی: {code}_

📊 *نظرسنجی ساخته شده با: [بات نظرسنجی](ble.ir/VoterBot)*
⚡ *قدرت گرفته از: [بلتون](balethon.ir/posts/about)*
""".strip()

option = """
{i}) {text}
🔹 _%{percentage} | {voters_count} نفر_
""".strip()

default_poll = """
نظرسنجی عادی
""".strip()

multiple_answers_poll = """
نظرسنجی چند جوابی
""".strip()

quiz_poll = """
نظرسنجی آزمون
""".strip()

start = """
• سلام ( {user} )

📊 با استفاده از این بازو میتوانید *نظرسنجی* ایجاد کنید و داخل کانال یا گروهتان ارسال کنید

🔺 *این بات از [Balethon](balethon.ir/posts/about) قدرت گرفته است*
""".strip()

help = """
⁉️ *راهنمایی بات*

• [نحوه اضافه کردن بات به کانال/گروه؟](send:/help invite_to_chat)

• [نحوه ساخت نظرسنجی و ارسال به کانال/گروه؟](send:/help create_poll)

• [دسترسی های لازم برای بات؟](send:/help access)

• [لینک اشتراک گذاری نظرسنجی چیست؟](send:/help poll_link)

• [محدودیت ها](send:/help limitations)

🆔 @voter_channel
""".strip()

invite_to_chat = """
⁉️ *نحوه افزودن ربات به کانال یا گروه*

🔹 ابتدا باید در نسخه وب بله web.bale.ai وارد حساب کاربری خود شوید.

🔺 سپس کانال یا گروه خود را انتخاب کنید و مراحل بالا را انجام دهید.

دسترسی های لازم برای برای ربات:
[ *ارسال پیام* ] و [ *ویرایش پیام* ]

🆔 @voter_channel | @VoterBot
""".strip()

create_poll = """
⁉️ *نحوه ساخت نظرسنجی و ارسال به گروه یا کانال*

🔹 پس از افزودن ربات به گروه/کانال و ادمین کردن آن، مراحل بالا را برای ساخت نظرسنجی انجام دهید !

🆔 @voter_channel | @VoterBot
""".strip()

access = """
دسترسی های لازم برای *ربات نظرسنجی* :
[ *ارسال پیام* ] و [ *ویرایش پیام* ]

🆔 @voter_channel | @VoterBot
""".strip()

poll_link = """
⁉️ *لینک اشتراک گذاری نظرسنجی چه کاربردی داره ؟*

🔘 *اگر نمیخواهید نظرسنجی را به کانال یا گروهی بفرستید، کافی است لینکی که ربات بعد از ساخت نظرسنجی میفرسته رو با هرکس که میخواید به اشتراک بذارید.*

🔘 *و هرکسی با استفاده از لینک، ربات را استارت کند نظرسنجی را دریافت میکند.*

🆔 @voter_channel | @VoterBot
""".strip()

limitations = """
⛔️ *محدودیت های نظرسنجی*

• محدودیت تعداد کارکتر سوال : *255*
• محدودیت تعداد کارکتر گزینه ها : *60*
• سقف تعداد گزینه هر نظرسنجی : *10*

🆔 @voter_channel | @VoterBot
""".strip()

support = """
💬 *نظرات، پیشنهادات، انتقادات و مشکلات خود را در گروه زیر مطرح کنید :*
ble.ir/join/882iEVRkeq

🔻 *همچنین برای اطلاع از آپدیت و اخبار بات نظرسنجی، به کانال ما بپویندید:*
https://ble.ir/voter_channel

👤 سازنده ها: @rascalx و @sajiminer0
""".strip()

select_poll_type = """
📊 *نوع نظرسنجی را انتخاب کنید*
""".strip()

select_poll_mode = """
🛃 *حالت نظرسنجی را انتخاب کنید*
```[فرق بین عمومی و ناشناس چیست؟]
در حالت عمومی امکان مشاهده رای دهنگان برای شما فراهم خواهد بود
در حالت ناشناس این امکان فراهم نخواهد بود
```
""".strip()

give_question = """
🔺 *سوال نظرسنجی خود را ارسال کنید* :
""".strip()

question_too_long = """
‼️ تعداد نویسه سوال باید کمتر از *۲۵۵* باشد؛ سوال خود را اصلاح کنید و مجدد ارسال کنید
""".strip()

give_first_option = """
🟢 بسیار‌عالی! *گزینه اول سوال را ارسال کنید*
""".strip()

option_too_long = """
‼️ تعداد نویسه گزینه باید کمتر از *۷۰* باشد؛ گزینه خود را اصلاح کنید و مجدد ارسال کنید
""".strip()

give_second_option = """
🟢 *حالا گزینه دوم را ارسال کنید*
""".strip()

more_options = """
{options}

🟢 *«گزینه دیگری اضافه میکنید یا نظرسنجی تکمیل شود؟»* 👇
""".strip()

give_new_option = """
🟢 *گزینه جدید را ارسال کنید*
""".strip()

select_correct_option = """
✳️ *گزینه صحیح آزمون را انتخاب کنید*
""".strip()
