start = """
• سلام ( {user} )

📊 با استفاده از این بازو میتوانید *نظرسنجی* ایجاد کنید و داخل کانال یا گروهتان ارسال کنید.

🔺 *این بازو از* [Balethon](https://Balethon.ir) *قدرت گرفته است.*
""".strip()

poll_types = """
📊 *نوع نظرسنجی را انتخاب کنید*
""".strip()

poll_modes = """
🛃 *حالت نظرسنجی را انتخاب کنید*
```[فرق بین عمومی و ناشناس چیست؟]
در حالت عمومی امکان مشاهده رای دهنگان برای شما فراهم خواهد بود.
در حالت ناشناس این امکان فراهم نخواهد بود.
```
""".strip()

question = """
🔺 *سوال نظرسنجی خود را ارسال کنید* :
""".strip()

question_limitation = """
‼️ تعداد نویسه سوال باید کمتر از *۲۵۵* باشد؛ سوال خود را اصلاح کنید و مجدد ارسال کنید.
""".strip()

first_option = """
🟢 بسیار‌عالی! *گزینه اول سوال را ارسال کنید.*
""".strip()

option_limitation = """
‼️ تعداد نویسه گزینه باید کمتر از *۷۰* باشد؛ گزینه خود را اصلاح کنید و مجدد ارسال کنید.
""".strip()

second_option = """
🟢 *حالا گزینه دوم را ارسال کنید.*
""".strip()

other_options = """
{options}

🟢 *«گزینه دیگری اضافه میکنید یا نظرسنجی تکمیل شود؟»* 👇
""".strip()

new_option = """
🟢 *گزینه جدید را ارسال کنید.*
""".strip()

select_correct_option = """
✳️ *گزینه صحیح آزمون را انتخاب کنید*
""".strip()
