poll = """
💠 *{question}*

{options}

👥 تعداد آراء: {voters_count} نفر
_کد نظرسنجی: {code}_

📊 *نظرسنجی ساخته شده با: [بات نظرسنجی](ble.ir/VoterBot)*
⚡ *قدرت گرفته از: [بلتون](balethon.ir)*
""".strip()

option = """
{i}) {text}
🔹 _%{percentage} | {voters_count} نفر_
""".strip()

start = """
• سلام ( {user} )

📊 با استفاده از این بازو میتوانید *نظرسنجی* ایجاد کنید و داخل کانال یا گروهتان ارسال کنید.

🔺 *این بازو از* [Balethon](https://Balethon.ir) *قدرت گرفته است.*
""".strip()

select_poll_type = """
📊 *نوع نظرسنجی را انتخاب کنید*
""".strip()

select_poll_mode = """
🛃 *حالت نظرسنجی را انتخاب کنید*
```[فرق بین عمومی و ناشناس چیست؟]
در حالت عمومی امکان مشاهده رای دهنگان برای شما فراهم خواهد بود.
در حالت ناشناس این امکان فراهم نخواهد بود.
```
""".strip()

give_question = """
🔺 *سوال نظرسنجی خود را ارسال کنید* :
""".strip()

question_too_long = """
‼️ تعداد نویسه سوال باید کمتر از *۲۵۵* باشد؛ سوال خود را اصلاح کنید و مجدد ارسال کنید.
""".strip()

give_first_option = """
🟢 بسیار‌عالی! *گزینه اول سوال را ارسال کنید.*
""".strip()

option_too_long = """
‼️ تعداد نویسه گزینه باید کمتر از *۷۰* باشد؛ گزینه خود را اصلاح کنید و مجدد ارسال کنید.
""".strip()

give_second_option = """
🟢 *حالا گزینه دوم را ارسال کنید.*
""".strip()

more_options = """
{options}

🟢 *«گزینه دیگری اضافه میکنید یا نظرسنجی تکمیل شود؟»* 👇
""".strip()

give_new_option = """
🟢 *گزینه جدید را ارسال کنید.*
""".strip()

select_correct_option = """
✳️ *گزینه صحیح آزمون را انتخاب کنید*
""".strip()
